import React, { useEffect } from 'react'
import AOS from 'aos';
import 'aos/dist/aos.css';

const Lecturers = () => {

    useEffect(() => {
        AOS.init(); // Initialize AOS on component mount
      }, []);

  return <>
  
  <section className='lecturers'>
    <div className="container">
        <h5 data-aos="fade-up" data-aos-duration={200} > المحاضرون </h5>
        <p data-aos="fade-up" data-aos-duration={300} > يضم فريق المحاضرين المتخصصين في تطوير المناهج الدراسية وتصميم الدروس، ويتمتعون بخبرة واسعة في مجالات مثل التعلم النشط والتعليم الإلكتروني والتقويم التربوي وإدارة الفصول الدراسية، ويسعون جاهدين لتزويد المعلمين والمدربين بالمعرفة والأدوات اللازمة لتحسين جودة التعليم وزيادة فعالية التعلم </p>
        <div className="row">
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/1.webp" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/2.webp" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                        <li data-aos="fade-up" data-aos-duration={600} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                        <li data-aos="fade-up" data-aos-duration={700} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/3.webp" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/4.webp" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/5.webp" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
            <div className="col-lg-6">
                <div className="cord">
                    <img className='w-100 ' src="/Image/lecturers/6.png" alt="" />
                    <h3>مستر ابراهيم عادل</h3>
                    <ul>
                        <li data-aos="fade-up" data-aos-duration={300} > صاحب ومؤسس قناة zAmericanEnglish، القناة المصنفة رقم 1 عالميا لأربع سنوات متتالية، لتعليم اللغة الإنجليزية ومشترك فيها وينتفع بمحتواها ما يقترب من 10 مليون شخص حول العالم. </li>
                        <li data-aos="fade-up" data-aos-duration={400} >حصل على البكالوريوس من جامعة A&M تكساس ثم بعدها حصل على رخصة تدريس اللغة الانجليزية من Notting Hill بريطانيا وشهادة TKT لاختبار مهارات التدريس من كامبريدج بريطانيا، وبهذا أصبح قادراً على تدريس اللغة بشكل ممتاز حتى تمكن من الوصول إلى رئيس قسم الصوتيات بأحد مدارس تعلم الانجليزية فى هونج كونج.</li>
                        <li data-aos="fade-up" data-aos-duration={500} >قام بإنشاء تطبيق مرتبط بدروس القناة، وانشاء موقع ضخم لمنصته، كما قام بطرح مشروع (طليق - Taleek) لتعلم اللغة الالمانية والفرنسية والصينية والتركية والروسية وغيرها. ومؤخرا أطلق منصة Octucode لتعليم البرمجة.</li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
  </section>

  </>
}

export default Lecturers